#  1) 0 დან 100 მდე დაპრინტეთ ყველა რიცხვი .
# 2) 40 დან 250 ის ჩათვლით დაპრინტეთ  ყველა ლუწი რიცხვი
# 3) 200 დან 400 მდე დაპრინტეთ ყველა 5 ის და 4 ის ჯერადი რიცხვი .
# 4) მომხმარებელს შემოატანინეთ რიცხვი და 2 დან ამ რიცხვის ჩათვლით დაპრინტეთ ყველა რიცხვი.
# 5) მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვიდან 0 მდე დაპრინტეთ ყველა რიცხვი უკუსვლით.
# 6) რიცხვის გამოცნობა -> შექმენით number ცვლადი და შეინახეთ რაიმე რიცხვი. მომხმარებელს შემოატანინეთ რიცხვი მანამ სანამ თქვენს მიერ ჩაფიქრებულ რიცხვს არ შემოიტანს.
# 7) SoloLearn
for i in range(0,101):
    print(i)

for i in range (40,251):
    if i % 2 == 0:
        print(i)

for i in range(200, 401):
    if i % 4 == 0 and i % 5 == 0:
        print(i)
    
num = int(input("Enter number:"))

for i in range(2, num + 1):
    print(i)

num1 = int(input("Enter number: "))

for i in range(num1, -1, -1):
    print(i)